### Multiindex

In [1]:
import pandas as pd
import numpy as np

data = pd.Series(np.random.randn(10), 
                  index=[[1,1,1,2,2,3,4,4,4,4],
                         ['a','b','c','a','c','a','a','b','c','d']])

data

1  a   -0.176462
   b    2.621576
   c   -1.238099
2  a   -1.008048
   c    0.554489
3  a   -2.321742
4  a    1.591403
   b    0.984176
   c    1.186126
   d   -0.564867
dtype: float64

In [2]:
data.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'c'),
            (3, 'a'),
            (4, 'a'),
            (4, 'b'),
            (4, 'c'),
            (4, 'd')],
           )

In [3]:
data[1]

a   -0.176462
b    2.621576
c   -1.238099
dtype: float64

In [4]:
data[1,'b']

2.621575709132544

In [5]:
data[:,'c']

1   -1.238099
2    0.554489
4    1.186126
dtype: float64

In [6]:
data[[1,2]]

1  a   -0.176462
   b    2.621576
   c   -1.238099
2  a   -1.008048
   c    0.554489
dtype: float64

In [7]:
data[3:]

2  a   -1.008048
   c    0.554489
3  a   -2.321742
4  a    1.591403
   b    0.984176
   c    1.186126
   d   -0.564867
dtype: float64

In [8]:
data.unstack()

          a         b         c         d
1 -0.176462  2.621576 -1.238099       NaN
2 -1.008048       NaN  0.554489       NaN
3 -2.321742       NaN       NaN       NaN
4  1.591403  0.984176  1.186126 -0.564867

In [9]:
df = pd.DataFrame(np.arange(9).reshape(3,3))
df

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [10]:
df = pd.DataFrame(np.arange(9).reshape(3,3), index=[[1,1,2],['a','b','a']])
df

     0  1  2
1 a  0  1  2
  b  3  4  5
2 a  6  7  8

In [11]:
df = pd.DataFrame(np.arange(9).reshape(3,3), 
                  index=[[1,1,2],['a','b','a']],
                 columns=[['L1C1','L1C1','L1C2'],['L2C1','L2C2','L2C1']])
df

    L1C1      L1C2
    L2C1 L2C2 L2C1
1 a    0    1    2
  b    3    4    5
2 a    6    7    8

In [12]:
df.index.names=['Idx1','Idx2']
df.columns.names=['Level1','Level2']
df

Level1    L1C1      L1C2
Level2    L2C1 L2C2 L2C1
Idx1 Idx2
1    a       0    1    2
     b       3    4    5
2    a       6    7    8

In [13]:
df.loc[1]

Level1 L1C1      L1C2
Level2 L2C1 L2C2 L2C1
Idx2
a         0    1    2
b         3    4    5

In [14]:
df.loc[1,'b']

Level1  Level2
L1C1    L2C1      3
        L2C2      4
L1C2    L2C1      5
Name: (1, b), dtype: int32

In [15]:
df['L1C1']

Level2     L2C1  L2C2
Idx1 Idx2
1    a        0     1
     b        3     4
2    a        6     7

In [16]:
df['L1C1','L2C1']

Idx1  Idx2
1     a       0
      b       3
2     a       6
Name: (L1C1, L2C1), dtype: int32

In [17]:
df

Level1    L1C1      L1C2
Level2    L2C1 L2C2 L2C1
Idx1 Idx2
1    a       0    1    2
     b       3    4    5
2    a       6    7    8

How to get item 4?

In [18]:
df.loc[1,'b']

Level1  Level2
L1C1    L2C1      3
        L2C2      4
L1C2    L2C1      5
Name: (1, b), dtype: int32

In [19]:
df.loc[1,'b']['L1C1','L2C2']

4

### Combining and Merging

In [20]:
df1= pd.DataFrame({'id':[1,2,3,4],'name':['Steven','Tom','Elsa','Tose']})
df1

   id    name
0   1  Steven
1   2     Tom
2   3    Elsa
3   4    Tose

In [21]:
df2=pd.DataFrame({'id':[1,3,5],'math':[80,90,100],'english':[90,100,50]})
df2

   id  math  english
0   1    80       90
1   3    90      100
2   5   100       50

In [22]:
pd.merge(df1,df2)

   id    name  math  english
0   1  Steven    80       90
1   3    Elsa    90      100

In [23]:
pd.merge(df1,df2,how='left')

   id    name  math  english
0   1  Steven  80.0     90.0
1   2     Tom   NaN      NaN
2   3    Elsa  90.0    100.0
3   4    Tose   NaN      NaN

In [24]:
pd.merge(df1,df2,how='right')

   id    name  math  english
0   1  Steven    80       90
1   3    Elsa    90      100
2   5     NaN   100       50

In [25]:
pd.merge(df1,df2,how='outer')

   id    name   math  english
0   1  Steven   80.0     90.0
1   2     Tom    NaN      NaN
2   3    Elsa   90.0    100.0
3   4    Tose    NaN      NaN
4   5     NaN  100.0     50.0

In [26]:
#join - merge by index
df1 = pd.DataFrame(np.arange(9).reshape(3,3))
df2 = pd.DataFrame([['a','b'],['c','d']], index=[1,2], columns=['x','y'])
df2

   x  y
1  a  b
2  c  d

In [27]:
df1.join(df2)

   0  1  2    x    y
0  0  1  2  NaN  NaN
1  3  4  5    a    b
2  6  7  8    c    d

In [28]:
import pandas as pd
import numpy as np

df = pd.DataFrame([[1,10,4],[1,20,5],[2,30,6],[2,40,7],[3,50,8]], columns=['key','value1','value2'])
df

   key  value1  value2
0    1      10       4
1    1      20       5
2    2      30       6
3    2      40       7
4    3      50       8

In [29]:
df.groupby(by='key')

In [30]:
for name,group in df.groupby(by='key'):
    print('name:',name)
    print('group:\n',group)

name: 1
group:
    key  value1  value2
0    1      10       4
1    1      20       5
name: 2
group:
    key  value1  value2
2    2      30       6
3    2      40       7
name: 3
group:
    key  value1  value2
4    3      50       8

### Aggregation

In [31]:
grp = df.groupby(by='key')

In [32]:
grp.agg('mean')

     value1  value2
key
1      15.0     4.5
2      35.0     6.5
3      50.0     8.0

In [33]:
grp.mean()

     value1  value2
key
1      15.0     4.5
2      35.0     6.5
3      50.0     8.0

In [34]:
grp.describe()

    value1                                               value2       \
     count  mean       std   min   25%   50%   75%   max  count mean
key
1      2.0  15.0  7.071068  10.0  12.5  15.0  17.5  20.0    2.0  4.5
2      2.0  35.0  7.071068  30.0  32.5  35.0  37.5  40.0    2.0  6.5
3      1.0  50.0       NaN  50.0  50.0  50.0  50.0  50.0    1.0  8.0


          std  min   25%  50%   75%  max
key
1    0.707107  4.0  4.25  4.5  4.75  5.0
2    0.707107  6.0  6.25  6.5  6.75  7.0
3         NaN  8.0  8.00  8.0  8.00  8.0

In [35]:
grp.agg({'value1':['mean','count'],'value2':['max','min']})

    value1       value2
      mean count    max min
key
1       15     2      5   4
2       35     2      7   6
3       50     1      8   8

In [36]:
grp.agg(np.var)

     value1  value2
key
1      50.0     0.5
2      50.0     0.5
3       NaN     NaN

In [37]:
grp.agg(np.sum)

     value1  value2
key
1        30       9
2        70      13
3        50       8

#### agg vs aggregation?

### Column-Wise

In [38]:
df = pd.DataFrame([[1,10,4],[1,20,5],[2,30,6],[2,40,7],[3,50,8]], columns=['key','value1','value2'])
df

   key  value1  value2
0    1      10       4
1    1      20       5
2    2      30       6
3    2      40       7
4    3      50       8

In [39]:
df['value1']/df['value2']

0    2.500000
1    4.000000
2    5.000000
3    5.714286
4    6.250000
dtype: float64

### Binary Data Formats read/write

In [40]:
import pandas as pd

df = pd.read_csv('data/demo.csv')

df.to_pickle('data/demo.pickle')

In [41]:
df = pd.read_pickle('data/demo.pickle')
df

   id    name  age  gender  grade
0   1  Steven   20    Male     80
1   2    Elsa   18  Femail    100
2   3    John   15    Male     90

In [42]:
import json
df = pd.read_json('data/acc-demo1.json')
df

            x       y       z
0      0.0560 -0.6716 -0.7525
1      0.0778 -0.6766 -0.7276
2      0.0673 -0.6601 -0.7863
3      0.0464 -0.6532 -0.7278
4      0.0354 -0.6551 -0.7671
...       ...     ...     ...
17890  0.0333 -0.7142 -0.6958
17891  0.0472 -0.7123 -0.6898
17892  0.0469 -0.7097 -0.6989
17893  0.0397 -0.7109 -0.6955
17894  0.0005 -0.7260 -0.7240

[17895 rows x 3 columns]

In [43]:
%time for i in range(1000): df.to_pickle('data/acc-demo1.pickle')

Wall time: 5.9 s

In [44]:
%time for i in range(1000): df.to_json('data/acc-demo1-bak.json')

Wall time: 34.8 s

!!! pickle is suitable for short term file storage because the formats of different version are different

### Work with Database

In [45]:
import sqlite3


con = sqlite3.connect('mydata.sqlite')

In [46]:
query = """
CREATE TABLE test
 (a VARCHAR(20), b VARCHAR(20),
 c REAL, d INTEGER
  );"""
con.execute(query)
con.commit()

OperationalError: table test already exists